rails/app/controllers/users_controller.rb

  def create
    @user = User.find_or_create_by(user_params)
---
INSERT INTO "users" ("first_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Shimmy"], ["email", "danielmxli@gmail.com"], ["created_at", 2016-11-13 00:11:42 UTC], ["updated_at", 2016-11-13 00:11:42 UTC]]

  def set_political_leaning
    @user = User.find(params[:id])
    @user.update(set_political_params) # may need to change political_leaning back to floating point value
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "users" SET "political_leaning" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["political_leaning", 0.0], ["updated_at", 2016-11-13 03:24:13 UTC], ["id", 1]]

  def set_interested_topics
    @user = User.find(params[:id])
    @interested_topics = params[:topics]
    @user.topics = Topic.where(name: @interested_topics)
---
SELECT "topics".* FROM "topics" WHERE "topics"."name" IN ('Education', 'Abortion')